generator/content/drastikbot/help/ud/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-14 Sat 17:42 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-ud" class="outline-2">
<h2 id="ud">Urban Dictionary</h2>
<div class="outline-text-2" id="text-ud">
<pre class="example" id="orga6fb05c">
Usage:
  ud [-lrah] [-s &lt;select&gt;] [--select &lt;select&gt;] [--list] [--id] [--random]
     [--autocomplete] [--help] &lt;words&gt;...

Retrieve word definitions from https://urbandictionary.org

Arguments:
  words              word(s) to search

Optional arguments:
  -s, --select       select other definitions (int)
  -l, --list         show a list of definitions
  --id               search by id
  -r, --random       define a random word
  -a, --autocomplete show possible completions
  -h, --help         link to this help


If no arguments are given, it will return the word of the day. You can pass a
word or a phrase to search for its definition.

The --select argument can be used to view other definitions.

Examples:
  ud
  ud -s 2
  ud IRC
  ud internet -s 2
  ud chat -l
  ud -r
</pre>
</div>
</div>
</div>
</body>
</html>
